IdeaRS.OpenModel.Result.OpenModelResult
Results of open model

IdeaRS.OpenModel.Result.OpenModelResult.#ctor
Constructor

IdeaRS.OpenModel.Result.OpenModelResult.SaveToXmlFile(System.String)
Saves content into file as a XML format
xmlFileName: XML file name
Returns: True if succeeded

IdeaRS.OpenModel.Result.OpenModelResult.LoadFromXmlFile(System.String)
Creates the instance of Open Model Result from the XML file
xmlFileName: XML file name
Returns: Open Model Result or null

IdeaRS.OpenModel.Result.OpenModelResult.LoadFromStream(System.IO.Stream)
Creates the instance of Open Model Result  from the stream
xmlFileStream: The input stream
Returns: The new instance of Open Model Result

IdeaRS.OpenModel.Result.OpenModelResult.ResultOnMembers
Results on members